<template>
  <div>
    <baseLayout title="基本用法" subTitle="在拖动滑块时，显示当前值">
      <div class="bar1">
        <e-scrollbar>
          <div>
            阿斯顿撒旦撒旦阿斯顿撒旦所1
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所2
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所3
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所4
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所5
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所6
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所7
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所8
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所9
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所0
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所1
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所2
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所3
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所4
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所5
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所6
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所7
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所8
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所9
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所1
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所2
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所3
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所4
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所5
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所6
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所7
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所8
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所9
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所1
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所2
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所3
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所4
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所5
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所6
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所7
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所8
            <br />阿斯顿撒旦撒旦阿斯顿撒旦所9
          </div>
        </e-scrollbar>
      </div>
    </baseLayout>
  </div>
</template>

<script>
export default {
  name: "scrollbars",
};
</script>

<style lang="stylus" scoped>
.bar1 {
  width: 300px;
  height: 200px;
  border: 1px solid #ccc;
}
</style>